schedule = {
    'Понедельник': {
        'Числитель': {
            '18:50': 'Интеграллы и диффиеренциальные уравнения - практика',
            '20:30': 'Инженерная и компьютерная графика - лекция'
        },
        'Знаменатель': {
            '18:50': 'Интеграллы и диффиеренциальные уравнения - практика',
            '20:30': 'Дискретная математика - лекция'
        }
    },
    'Вторник': {
        'Числитель': {
            '18:50': 'Инженерная и компьютерная графика - практика',
            '20:30': 'Инженерная и компьютерная графика - практака'
        },
        'Знаменатель': {
            '18:50': 'Технологии программирования - практика',
            '20:30': 'Технологии программирования - практика'
        }
    },
    'Среда': {
        'Числитель': {
            '18:50': 'Физическая культура',
            '20:30': ''
        },
        'Знаменатель': {
            '18:50': 'Физическая культура',
            '20:30': ''
        }
    },
    'Четверг': {
        'Числитель': {
            '18:50': 'Философия - лекция',
            '20:30': 'Дискретная математика - практика'
        },
        'Знаменатель': {
            '18:50': 'Философия - практика',
            '20:30': 'Дискретная математика - практика'
        }
    },
    'Пятница': {
        'Числитель': {
            '18:50': 'Интеграллы и диффиеренциальные уравнения - лекция',
            '20:30': 'Иностраннный язык'
        },
        'Знаменатель': {
            '18:50': 'Технологии программирования - лекция',
            '20:30': 'Иностраннный язык'
        }
    }
}
